const subject_choice = [
    // 語文
    {
        A:"在非課上時間看課外關於詩文、作家的讀物或國外雜誌、新聞報導，更了解一段課文之中的背景與文化脈絡。",
        B:"吸收並能表達課文內容之外，複習已完成的作業並預習之後上課的課文內容，可以連貫超前進度與過去學習之間的內容。",
        C:"將課文內容吸收後，用自己的語言寫下筆記，並複習完成後的作業，對課文有更深刻的理解與記憶。",
        D:"背誦課文內容，完成最低限度的上課。"
    },
    // 自然科學
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 綜合活動
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 數學
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 科技
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 健康與體育
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 社會
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
    // 藝術
    {
        A:"",
        B:"",
        C:"",
        D:""
    },
];




const doSubject = {
    key: 'doSubject',
    preload: function(){
        console.log(subject_choice[0].A);
        
    },
    create: function(){
        
            
    },
    update: function(){

    }
}
